/*Завдання 1: Умови та масиви

Вхід: [4, 4, 8, 3, 3, 3, 2, 4, 4]

Вивести кожен елемент масиву. 
Вивести перші 3 елементи масиву
Вивести суму всіх елементів
Вивести суму всіх елементів, окрім елемента, що = 4;
*/

// Вивести кожен елемент масиву. 
arr = [4, 4, 8, 3, 3, 3, 2, 4, 4]
console.log("\nВивести кожен елемент масиву.")
arr.forEach(element => {
    console.log(element)    
});

// Вивести перші 3 елементи масиву
console.log("\nВивести перші 3 елементи масиву")
for (let i = 0; i <= 2 ; i++) {
    console.log(arr[i])
}

// Вивести суму всіх елементів
let sum = 0
arr.forEach(element => {
    sum+=element 
});
console.log(`\nСума всіх елементів = ${sum}`)

// Вивести суму всіх елементів, окрім елемента, що = 4;
sum = 0
arr.forEach(element => {
    if(element!==4){
        sum+=element 
    }   
});

console.log(`\nСума всіх елементів окрім елемента що = 4 дорівнює ${sum}`)


